# 1. define list of mouth radical-containing characters which should be JCZized from text
# extracted from https://en.wiktionary.org/wiki/Index:Chinese_radical/%E5%8F%A3 (Apr 2021), removed all tofu glyphs
mouth_list_whitelist = ['古', '句', '另', '叧', '只', '叫', '召', '可', '台', '史', '右', '叴', '叵', '号', '司', '叾', '㕣',  # +2 strokes[edit]
  '吂', '吃', '各', '合', '吉', '吊', '同', '名', '后', '吏', '吐', '向', '吕', '㕦', # +3 strokes[edit]
  '君', '吝', '吞', '吟', '吠', '吢', '否', '含', '吳', '吴', '吵', '吸', '吹', # +4 strokes[edit]
  '吻', '吼', '吾', '吿', '呂', '呄', '呆', '呇', '呈', '呉', '告', '呑', '员',
  '呙', '㕯', '吩',
  '周', '呰', '味', '呻', '呼', '命', '咅', '咆', '咎', '咐','㕺', '㕻', '㕾', # +5 strokes[edit]
  '㕿',
  '咢', '咫', '咬', '咸', '哉', '哛', '㖈', '㖋', '㖌', '㖍', '㖎', # +6 strokes[edit]
  '員', '哥', '哮', '哲', '哿', '唇', '唐', '唘', '唜', '唟', '㖖', '㖙', '㖚', # '㖛', '㖜', '㖝', # +7 strokes[edit]
  '售', '商', '啇', '啎',
  '問', '啓', '啔', '啚',
  '啜', '㖯',
  '㖰', '㖱', # +8 strokes[edit] # '㖲', '㖳', '𠶘',  
  '啙', '喆', '喉', '喊', '喋', '喌', '喘', '喚', '喜', '喝', '喣', '喦', '喧', '喩', '喪', '喫', # +9 strokes[edit]
  '單', '営', '喷', '喸', '喻', '喾', '㗊', '𠷡', '𠸗', '𠸙', '𠸛', '𠸜',
  '喿', '嗀', '嗇', '嗌', '嗠', '嗣', '嗧', '嗭', '嗲', '㗗', '㗟', '㗠', '㗡', '𠹾', '𠺘', '𠺥', '𠺯', '𠻁', '𠻇', # +10 strokes[edit]
  '嘂', '嘆', '嘉', '嘏', '嘗', '嘘', '嘦', '㗤', '㗬', '㗯', '嘲', '嘳', '嘴', '𠻸', '𠼷', '𠼿', '𠽘', '𠽚', # +11 strokes[edit]
  '噂', '噏', '噖', '𠾹', # +12 strokes[edit]
  '噟', '噩', '器', '噪', '噵', '㗽', '𠿟', '𠿲', '𡀪', # +13 strokes[edit]
  '噽', '嚇', '嚐', # +14 strokes[edit]
  '嚚', '嚢', '嚣', '㘏', '𡂢', # +15 strokes[edit]
  '嚭', '嚮', '㘒', '𡄀', '嚲', # +16 strokes[edit]
  '嚳', '嚴', '𡄰', '囍', # +17 strokes[edit]
  '嚻', '囂', '𡄻', '𡅐', # +18 strokes[edit]
  '囅', '囏',  # +19 strokes[edit]
  '囑',  # +21 strokes[edit]
]
mouth_list = [
  '叨', '叩', '叭', '叮', '叱', '叶', '叹', '叺', '叻', '叼','叽', '㕤', # +2 strokes[edit]
  '㕥', '𠮟', '𠮨', '𠮩',
  '叿', '吀', '吁', '吅', '吆', '吇', '吋', '吒', # +3 strokes[edit]
  '吓', '吔', '吖', '吗', '㕧', '㕨',
  '吘', '吙', '吚', '吜', '吡', '吣', '吤', '吥', '吧', '吨', '吪', # +4 strokes[edit]
  '听', '吭', '吮', '启', '吰', '吱', '吲', '吶', '吷', '吺', '吽', '呀',
  '呁', '呃', '呅', '呋', '呌', '呍', '呎', '呏', '呐', '呒', '呓', '呔',
  '呕', '呖', '呗', '呚', '呛', '呜', '㕩', '㕪', '㕫', '㕬', '㕭', '㕮',
  '㕰', '㕱', '㕲', '㕳', '㕴', '㕵', '㕶', '𠯋', '𠯗', '𠯢', '𠯦', '𠯪',
  '𠯫', '𠯹', '𠯻', '𠯼', '𠯽', '𠯾', '𠯿', '𠰀', '𠰁', '𠰂', '𠰃',
  '呝', '呞', '呟', '呠', '呡', '呢', '呣', '呤', '呥', '呦', '呧', '呩', # +5 strokes[edit]
  '呪', '呫', '呬', '呭', '呮', '呯', '呱', '呲', '呴', '呵', '呶', '呷',
  '呸', '呹', '呺', '呾', '呿', '咀', '咁', '咂', '咃', '咄', '咇', '咈',
  '咉', '咊', '咋', '和', '咍', '咏', '咑', '咒', '咓', '咔', '咕', '咖',
  '咗', '咘', '咙', '咚', '咛', '咜', '咝', '㕷', '㕸', '㕹', '㕼', '㕽',
  '咞', '咟', '咠', '咡', '咣', '咤', '咥', '咦', '咧', '咨', '咩', '咪', # +6 strokes[edit]
  '咭', '咮', '咯', '咰', '咱', '咲', '咳', '咴', '咵', '咶', '咷', '咹',
  '咺', '咻', '咼', '咽', '咾', '咿', '哀', '品', '哂', '哃', '哄', '哅',
  '哆', '哇', '哈', '哊', '哋', '哌', '响', '哎', '哏', '哐', '哑', '哒',
  '哓', '哔', '哕', '哖', '哗', '哘', '哙', '哚', '哜', '哝', '哞', '哟',
  '㖀', '㖁', '㖂', '㖃', '㖄', '㖅', '㖆', '㖇', '㖉', '㖊', '𠱓', '𠱘',
  '𠱜', '𠱤', '𠱥', '𠱶', '𠱷', '𠱸', '𠱼', '𠲍', '𠲏', '𠲓', '𠲔', '𠲖',
  '哠', '哢', '哣', '哤', '哦', '哧', '哨', '哩', '哪', '哫', '哬', '哭', # +7 strokes[edit]
  '哯', '哰', '哱', '哳', '哴', '哵', '哶', '哷', '哸', '哹', '哺', '哻',
  '哼', '哽', '哾', '唀', '唁', '唂', '唃', '唄', '唅', '唆', '唈', '唉',
  '唊', '唋', '唌', '唍', '唎', '唏', '唑', '唒', '唓', '唔', '唕', '唖',
  '唗', '唙', '唚', '唛', '唝', '唞', '唠', '唡', '唢', '唣', '唤', '唥',
  '唦', '唧', '㖏', '㖐', '㖑', '㖒', '㖓', '㖔', '㖕', '㖗', '㖘', '㖞',
  '唨', '唩', '唪', '唫', '唬', '唭', '唯', '唰', '唱', '唲', '唳', '唴', # +8 strokes[edit]
  '唵', '唶', '唷', '唸', '唹', '唺', '唻', '唼', '唽', '唾', '唿', '啀',
  '啁', '啂', '啃', '啄', '啅', '啈', '啉', '啊', '啋', '啌', '啍', '啐',
  '啑', '啒', '啕', '啖', '啗', '啘', '啛', '啝', '啞', '啠', '啡', '啢',
  '啣', '啤', '啥', '啦', '啧', '啨', '啩', '啪', '啬', '啭', '啮', '啯',
  '啰', '啱', '啲', '啳', '啴', '啵', '啶', '啷', '啸', '啹', '㖟', '㖠',
  '㖡', '㖢', '㖣', '㖤', '㖥', '㖦', '㖧', '㖨', '㖩', '㖪', '㖫', '㖬',
  '㖭', '㖮', '㖴', '㖵', '𠴨', '𠴫', '𠴰', '𠴱', '𠴲', '𠴼', '𠵅', '𠵆',
  '𠵇', '𠵈', '𠵉', '𠵋', '𠵌', '𠵎', '𠵏', '𠵐', '𠵘', '𠵚', '𠵨', '𠵩',
  '𠵯', '𠵱', '𠵴', '𠵼', '𠵽', '𠵾', '𠵿', '𠶀', '𠶁', '𠶂', '𠶃', '𠶄',
  '𠶅', '𠶆', '𠶇', '𠶈', '𠶉', '𠶊', '𠶋', '𠶌', '𠶍', '𠶎', '𠶏', '𠶐',
  '𠶑', '𠶒', '𠶓', '𠶔', '𠶕', '𠶖', '𠶗', '𠶙', '𠶚', '𠶛', '𠶜', '𠶝',
  '𠶞', '𠶟', '𠶠', '𠶡', '𠶢', '𠶣', '𠶤', '𠶥', '𠶦', '𠶧', '𠶯','𠶲',
  '唾', '啫', '啺', '啻', '啼', '啽', '啾', '啿', '喀', '喁', '喂', '喃', # +9 strokes[edit]
  '善', '喅', '喇', '喈', '喎', '喏', '喐', '喑', '喒', '喓', '喔', '喕',
  '喖', '喗', '喙', '喛', '喞', '喟', '喠', '喡', '喢', '喤', '喥', '喨',
  '喬', '喭', '喯', '喰', '喱', '喲', '喳', '喴', '喵', '喹', '喺', '喼',
  '喽', '噅', '㖶', '㖷', '㖸', '㖹', '㖺', '㖻', '㖼', '㖽', '㖾', '㖿',
  '㗀', '㗁', '㗂', '㗃', '㗄', '㗅', '㗆', '㗇', '㗈', '㗉', '㗋', '㗌',
  '㗍', '㗎', '㗏', '㗐', '㗑', '𠷇', '𠷈', '𠷐', '𠷤', '𠷥', '𠷦', '𠸂',
  '𠸄', '𠸉', '𠸊', '𠸍', '𠸎', '𠸏', '𠸐', '𠸑', '𠸒', '𠸓', '𠸔', '𠸕',
  '𠸖', '𠸘', '𠸚', '𠸝', '𠸞', '𠸟', '𠸠', '𠸡', '𠸢', '𠸣', '𠸤', '𠸥',
  '𠸦', '𠸧', '𠸨', '𠸩', '𠸪', '𠸫', '𠸬', '𠸼', '𠸽', '𠸾',
  '喍', '嗁', '嗂', '嗃', '嗄', '嗅', '嗆', '嗈', '嗉', '嗊', '嗋', '嗍', # +10 strokes[edit]
  '嗎', '嗏', '嗐', '嗑', '嗒', '嗓', '嗔', '嗕', '嗖', '嗗', '嗘', '嗙',
  '嗚', '嗛', '嗜', '嗝', '嗞', '嗟', '嗡', '嗢', '嗤', '嗥', '嗦', '嗨',
  '嗩', '嗪', '嗫', '嗬', '嗮', '嗯', '嗰', '嗱', '嗳', '嗴', '嗵', '㗒',
  '㗓', '㗔', '㗕', '㗖', '㗘', '㗙', '㗚', '㗛', '㗜', '㗝', '㗞', '𠸺',
  '𠹌', '𠹗', '𠹤', '𠹭', '𠹯', '𠹳', '𠹴', '𠹵', '𠹶', '𠹷', '𠹸', '𠹹',
  '𠹺', '𠹻', '𠹼', '𠹽', '𠺌', '𠺕', '𠺖', '𠺙', '𠺚', '𠺝', '𠺟', '𠺠',
  '𠺢', '𠺦', '𠺧', '𠺨', '𠺩', '𠺪', '𠺫', '𠺬', '𠺭', '𠺮', '𠺰', '𠺱',
  '𠺲', '𠺳', '𠺴', '𠺵', '𠺶', '𠺷', '𠺸', '𠺹', '𠺺', '𠺻', '𠺼', '𠺽',
  '𠺾', '𠺿', '𠻀', '𠻂', '𠻃', '𠻄', '𠻅', '𠻆', '𠻈', '𠻉', '𠻊', '𠻋',
  '𠻒', '𠻓',
  '嗶', '嗷', '嗸', '嗹', '嗺', '嗻', '嗼', '嗽', '嗾', '嗿', '嘀', '嘁', # +11 strokes[edit]
  '嘃', '嘄', '嘅', '嘇', '嘈', '嘊', '嘋', '嘌', '嘍', '嘎', '嘐', '嘑',
  '嘒', '嘓', '嘔', '嘕', '嘖', '嘙', '嘚', '嘛', '嘜', '嘝', '嘞', '嘡',
  '嘢', '嘣', '嘤', '嘥', '嘧', '噑', '噓', '㗢', '㗣', '㗥', '㗦', '㗧',
  '㗨', '㗩', '㗪', '㗫', '㗭', '㗮', '㗰', '𠻤', '𠻥', '𠻪', '𠻬', '𠻱',
  '𠻴', '𠻵', '𠻷', '𠻹', '𠻺', '𠻻', '𠻼', '𠻽', '𠼕', '𠼖', '𠼝', '𠼦',
  '𠼪', '𠼭', '𠼮', '𠼯', '𠼰', '𠼱', '𠼲', '𠼳', '𠼴', '𠼵', '𠼶', '𠼸',
  '𠼹', '𠼺', '𠼻', '𠼼', '𠼽', '𠼾', '𠽀', '𠽁', '𠽂', '𠽃', '𠽄', '𠽅',
  '𠽆', '𠽇', '𠽈', '𠽉', '𠽊', '𠽋', '𠽌', '𠽍', '𠽎', '𠽏', '𠽐', '𠽑',
  '𠽒', '𠽓', '𠽔', '𠽕', '𠽖', '𠽗', '𠽙', '𠽛', '𠽞', '𠽟',
  '嘟', '嘠', '嘨', '嘩', '嘪', '嘫', '嘬', '嘭', '嘮', '嘯', '嘰', '嘱', # +12 strokes[edit]
  '嘵', '嘶', '嘷', '嘸', '嘹', '嘺', '嘻', '嘼', '嘽', '嘾', '嘿', '噀',
  '噁', '噃', '噄', '噆', '噇', '噈', '噉', '噊', '噋', '噌', '噍', '噎',
  '噐', '噒', '噔', '噗', '噘', '噙', '噚', '噛', '噜', '噝', '噴', '㗱',
  '㗲', '㗳', '㗴', '㗵', '㗶', '㗷', '㗸', '㗹', '㗺', '𠹰', '𠹱', '𠹲',
  '𠽤', '𠽮', '𠽾', '𠾀', '𠾍', '𠾏', '𠾐', '𠾒', '𠾓', '𠾔', '𠾕', '𠾛',
  '𠾣', '𠾦', '𠾭', '𠾴', '𠾵', '𠾶', '𠾷', '𠾸', '𠾺', '𠾻', '𠾼', '𠾽',
  '𠾾', '𠾿', '𠿀', '𠿁', '𠿂', '𠿃', '𠿄', '𡀔', '𡀦',
  '噞', '噠', '噡', '噢', '噣', '噤', '噥', '噦', '噧', '噫', '噬', '噭', # +13 strokes[edit]
  '噮', '噯', '噰', '噱', '噲', '噳', '噶', '噷', '噸', '噹', '噺', '噻',
  '噼', '㗻', '㗼', '㗾', '㗿', '㘀', '㘁', '㘂', '㘃', '㘄', '𠿈', '𠿒',
  '𠿚', '𠿪', '𠿫', '𠿬', '𠿭', '𠿮', '𠿯', '𠿰', '𠿱', '𠿳', '𠿴', '𠿵',
  '𠿶', '𠿷', '𠿸', '𠿹', '𠿿', '𡀂', '𡀇', '𡀝', '𡀞', '𡀠', '𡀡', '𡀢',
  '𡀣', '𡀤', '𡀥', '𡀧', '𡀨', '𡀩', '𡀫', '𡀬', '𡀭', '𡀮', '𡀯', '𡀰',
  '𡀱', '𡀲', '𡀳', '𡀴', '𡀵', '𡀶', '𡀷',
  '噾', '噿', '嚀', '嚁', '嚂', '嚃', '嚄', '嚅', '嚆', '嚈', '嚉', '嚊', # +14 strokes[edit]
  '嚋', '嚌', '嚍', '嚎', '嚏', '嚑', '嚒', '嚓', '嚺', '㘅', '㘆', '㘇',
  '㘈', '𡀿', '𡁎', '𡁏', '𡁙', '𡁚', '𡁛', '𡁜', '𡁝', '𡁞', '𡁠', '𡁤',
  '𡁯', '𡁵', '𡁶', '𡁷', '𡁸', '𡁹', '𡁺', '𡁻', '𡁼', '𡁽', '𡁾', '𡁿',
  '𡂀', '𡂁', '𡂂', '𡂃', '𡂄', '𡂅', '𡂆', '𡂇', '𡂈', '𡂉', '𡂌', '𡂍',
  '𡂎',
  '嚔', '嚕', '嚖', '嚗', '嚘', '嚙', '嚛', '嚜', '嚝', '嚞', '嚟', '嚠', # +15 strokes[edit]
  '嚡', '嚤', '㘉', '㘊', '㘋', '㘌', '㘍', '㘎', '𡂑', '𡂒', '𡂓', '𡂖',
  '𡂙', '𡂝', '𡂡', '𡂮', '𡂯', '𡂰', '𡂱', '𡂲', '𡂳', '𡂴', '𡂵', '𡂷',
  '𡂹', '𡂿', '𡃀', '𡃁', '𡃇', '𡃈', '𡃉', '𡃊', '𡃋', '𡃌', '𡃍', '𡃎',
  '𡃏', '𡃐', '𡃑', '𡃒', '𡃓', '𡃔', '𡃕', '𡃖', '𡃗', '𡃘', '𡃙', '𡃚',
  '𡃛', '𡃜',
  '嚥', '嚦', '嚧', '嚨', '嚩', '嚪', '嚫', '嚬', '嚯', '嚰', '㘐', '㘑', # +16 strokes[edit]
  '𡃤', '𡃴', '𡃵', '𡃶', '𡃹', '𡃺', '𡃻', '𡃼', '𡃽', '𡃾', '𡃿', '𡄁',
  '𡄍', '𡄎', '𡄏', '𡄐',
  '嚱', '嚵', '嚶', '嚷', '嚸', '嚹', '㘓', '㘔', '𡄟', '𡄡', '𡄥', '𡄦', # +17 strokes[edit]
  '𡄧', '𡄨', '𡄩', '𡄪', '𡄫', '𡄬', '𡄭', '𡄮', '𡄯',
  '嚼', '嚽', '嚾', '嚿', '囀', '囁', '囃', '囄', '㘕', '㘖', '㘗', '𡄵', # +18 strokes[edit]
  '𡄽', '𡄾', '𡅅', '𡅈', '𡅉', '𡅊', '𡅋', '𡅌', '𡅍', '𡅎',
  '𡅏', '𡅑', '𡅒', '囆', '囇', '囈', '囉', '囊', '囋', '囎',
  '㘘', '𡅠', '𡅢', '𡅧', '𡅨', '𡅩', '𡅪', '𡅫', '𡅬', '𡅯', # +19 strokes[edit]
  '囌', '囐', '㘙', '㘚', '𡅳', '𡅷', # +20 strokes[edit]
  '囒', '囓', '𡆀', '𡆁', '𡆂', '𡆄', # +21 strokes[edit]
  '囔', '囕', '㘛', '𡆇', '𡆈', '𡆌', '𡆍' # +22 strokes[edit]
  '㘜', '𡆑', '𡆖', '𡆗', '𡆘', # +23 strokes[edit]
  '𡆙', '𡆚', '𡆞', # +24 strokes[edit]
  '囖' # +25 strokes[edit]
]
